Revit 2024 API
ParameterTypeId.PreferPatternAlignUiFilter Property
 "Pattern:": This is used by the UI to allow to select the preferred preference of aligning pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId PreferPatternAlignUiFilter { get; }
Visual Basic
Public Shared ReadOnly Property PreferPatternAlignUiFilter As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PreferPatternAlignUiFilter {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace